backend/app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "admin"], ["LIMIT", 1]]
---
  def login
    credentials = params.permit(:username, :password)

    user = User.find_by(username: credentials[:username]).try(:authenticate, credentials[:password])