backend/app/controllers/json_spec_controller.rb

  def load_action
    c = Contract.find_by!(client: params.require(:client), server: params.require(:server))
    @action = Action.find_by! name: params.require(:action_name), contract_id: c.id
---
SELECT  "contracts".* FROM "contracts" WHERE "contracts"."client" = $1 AND "contracts"."server" = $2 LIMIT $3  [["client", "Frontend"], ["server", "Backend"], ["LIMIT", 1]]
SELECT  "actions".* FROM "actions" WHERE "actions"."name" = $1 AND "actions"."contract_id" = $2 LIMIT $3  [["name", "Read record"], ["contract_id", 1], ["LIMIT", 1]]